In [6]:
# Create Series from array
import pandas as pd 
import numpy as np
from pandas import Series,DataFrame

In [13]:
arr = np.array(['python','php','java'])
seriesname =Series(arr)

In [11]:
series

0    python
1       php
2      java
dtype: object

In [18]:
# Create series using dict
dictionary_details = {'Courses' :"pandas", 'Fees' : 20000, 'Duration' : "30days"}
seriesname1 = Series(dictionary_details)

seriesname1

Courses     pandas
Fees         20000
Duration    30days
dtype: object

In [22]:
#create series from dict add index
data = {'Courses' :"pandas", 'Course_Fee' : 20000, 'Course_Duration' : "30days"}
seriesname3 = Series(data, index=['Courses','Course_Fee','Course_Duration'])
seriesname3

Courses            pandas
Course_Fee          20000
Course_Duration    30days
dtype: object

In [25]:
#Creating DataFrame from List
data = ['python','php','java']
ser11 = Series(data, index=['r1', 'r2','r3'])
ser11

r1    python
r2       php
r3      java
dtype: object

In [33]:
#create dataframe fro 2 series
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
pd.concat([courses,fees],axis=1)

   courses   fees
0    Spark  22000
1  PySpark  25000
2   Hadoop  23000

In [38]:
# create DataFrame with single column
data =  ["Python","PHP","Java"]
df = DataFrame(data, columns = ['Courses'])
my_series = df.squeeze()#convert dataframe to series
my_series

0    Python
1       PHP
2      Java
Name: Courses, dtype: object